# ДЛЯ ЗАДАНИЯ ВИДА:
# Заполните таблицу 2 и укажите объем выпуска,
# при котором фирма максимизирует свою прибыль.:
#
# ......ТАБЛИЦА.....
#
#
# где V – объем спроса, количество шт. единиц продукции,
# P – цена за единицу продукции,
# TC – общие валовые издержки,
# MC – предельные издержки,
# TR – общая выручка,
# MR – предельная выручка,
# 𝜋 – прибыль.

# Формулы:
# MC - ∆ТС/∆Q
# TR – общий доход = Р * Q.
# MR – предельный доход = ∆TR / ∆Q
# 𝜋 = TR – ТС

V = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# в некоторых задачах может быть указан как Q
P = [150, 140, 130, 120, 110, 100, 90, 80, 70, 60]
TC = [50, 140, 200, 240, 270, 330, 420, 550, 720, 960]
# Это считаем
MC = [None, 0, 0, 0, 0, 0, 0, 0, 0, 0]
TR = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
MR = [None, 0, 0, 0, 0, 0, 0, 0, 0, 0]
𝜋 = [None, 0, 0, 0, 0, 0, 0, 0, 0, 0]

print("V = {}, P = {}, TC = {}, MC = {}, TR = {}, MR = {}, 𝜋 = {}".format(V[0], P[0], TC[0], MC[0], TR[0], MR[0],
                                                                          𝜋[0]))
for i in range(1, len(V)):
    MC[i] = (TC[i] - TC[i - 1]) / (V[i] - V[i - 1])
    TR[i] = P[i] * V[i]
    MR[i] = (TR[i] - TR[i - 1]) / (V[i] - V[i - 1])
    𝜋[i] = TR[i] - TC[i]
    print("V = {}, P = {}, TC = {}, MC = {}, TR = {}, MR = {}, 𝜋 = {}".format(V[i], P[i], TC[i], MC[i], TR[i], MR[i],
                                                                              𝜋[i]))
